{
  "experience": [
    {
      "position": "Software Engineering Intern",
      "name": "ZALORA Singapore",
      "year": "May 2016 - Present",
      "details": "Full stack engineer tasked to develop a web application for mobile API abstraction. Currently the sole-developer on the project. Also, assisted with front-end development of their global fashion group website."
    }
  ],
  "education": [
    {
      "name": "National University of Singapore",
      "year": "2013 - Present",
      "studies": "B.Hons Computer Science with a minor in Economics",
      "results": "CAP: 3.64",
      "others": "Specializing in Interactive Media and Artificial Intelligence"
    },
    {
      "name": "University of Birmingham",
      "year": "Oct 2015 - Dec 2015",
      "studies": "Read Computational Vision, Machine Learning, Operating Systems, Chemistry for Engineering and Game Theory"
    },
    {
      "name": "Sunway College, Subang Jaya",
      "year": "2011 - 2012",
      "studies": "Took Cambridge GCE A-Levels for Chemistry, Physics, Economics and Math",
      "results": "Grades: 5A*"
    }
  ],
  "cca": [
    {
      "position": "Performer and Choreographer",
      "name": "NUS Sheares Hall Dance (DanShers)",
      "year": "2013 - Present",
      "desc": "Danshers is a group of dancers from Sheares Hall, heavily involved in three concerts throughout the year mainly, Good Luck Concert (GLC), SHout! and Dance Uncensored. I was the choreographer for Good Luck Concert 2014 and performed for all other events throughout my stay in Sheares Hall."
    },
    {
      "position": "Director of Resource",
      "name": "Directorate, NUS Cultural Activities Club",
      "year": "2014 - 2015",
      "desc": "NUS Cultural Activities Club (CAC) consists of 11 sub-club excluding the main directorate. Thus, I was in-charged of club's logistics and collation of resources especially venues and manpower for performance and rehearsals."
    },
    {
      "position": "Vice Chairperson",
      "name": "Camp Estrella, NUS Cultural Activities Club",
      "year": "2014",
      "desc": "Camp Estrella is a social camp to unite and orientate freshman on the cultural lifestyle in NUS. I was in-charged of the camp's internal affairs which are the program flow, logistics, resources as well as food and welfare of the participants."
    },
    {
      "position": "Director of Programmes",
      "name": "CAC+US Concert, NUS Cultural Activities Club",
      "year": "2014",
      "desc": "CAC+US is one of the largest concert in NUS incorporating performances from all of NUS CAC cultural sub-clubs. I organized and planned the program flow for the concert. I was also the liaison between the main committee and the sub-clubs."
    },
    {
      "position": "Director of Internal Relations",
      "name": "Cultural Week, NUS Cultural Activities Club",
      "year": "2014",
      "desc": "Cultural Week aims to promote awareness of NUS cultural clubs to the students mid-academic year. I was in-charged of internal publicity as well as liaison between the committee and the sub-clubs."
    },
    {
      "position": "Director of Special Projects",
      "name": "Sheares Welcome and Orientation Committee (SWOC)",
      "year": "2014",
      "desc": "Organized a 10 day camp for incoming freshman into Sheares Hall, NUS in which I coordinated and executed two main projects, flash mob and finale night, for the camp. I also assisted with drafting and execution of programmes for the camp."
    },
    {
      "position": "Secretary",
      "name": "A-Levels Student Council",
      "year": "2011 - 2012",
      "desc": "In-charged of archiving, records and drafting of letters and proposals of the Student Council. Also, Co-organized several events for my peers and A-Levels cohort."
    },
    {
      "position": "Dance Co-Leader and Choreographer",
      "name": "Love Is A Many Splendoured Thing! The Musical (LIAMST!)",
      "year": "2011 - 2012",
      "desc": "LIAMST! is an external charitable project in a form of a concert organized by Mr Kingsley Row. I was charged to lead a group of student dancers and choregraphed dance-pieces from a bygone era including the Rock & Roll and Charleston."
    }
  ],
  "achievements": [
    {
      "year": "2013",
      "info": [
        {
          "name": "ASEAN Undergraduate Scholarship"
        }
      ]
    },
    {
      "year": "2012",
      "info": [
        {
          "name": "Sunway College,",
          "desc": "Top Student in A1 Levels Economics"
        }
      ]
    },
    {
      "year": "2011",
      "info": [
        {
          "name": "Tan Sri Dato’ Seri Dr Jeffrey Cheah Scholarship"
        }
      ]
    }
  ]
}
